workspace/Catalogs/АукУчастникиАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукУчастникиАукционов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыАукционов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАукциона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАукциона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Catalogs/АукУчастникиАукционов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция УчастникиАукционаИИхКонтактныеЛицаПоВидуАукциона(пВидАукциона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_УчастникиАукционовВидыАукционов.Ссылка КАК Участник,
	|	Аук_УчастникиАукционовКонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо
	|ИЗ
	|	Справочник.АукУчастникиАукционов.ВидыАукционов КАК Аук_УчастникиАукционовВидыАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукУчастникиАукционов.КонтактныеЛица КАК Аук_УчастникиАукционовКонтактныеЛица
	|		ПО Аук_УчастникиАукционовВидыАукционов.Ссылка = Аук_УчастникиАукционовКонтактныеЛица.Ссылка
	|ГДЕ
	|	Аук_УчастникиАукционовВидыАукционов.ВидАукциона = &ВидАукциона
	|	И Аук_УчастникиАукционовКонтактныеЛица.ВидАукциона = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

Функция КонтактныеЛицаУчастникаПоВидуАукциона(пУчастники, пВидАукциона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_УчастникиАукционовКонтактныеЛица.Ссылка КАК Участник,
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка КАК КонтактноеЛицо
	|ИЗ
	|	Справочник.АукУчастникиАукционов.КонтактныеЛица КАК Аук_УчастникиАукционовКонтактныеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АукКонтактныеЛицаУчастниковАукционов КАК АукКонтактныеЛицаУчастниковАукционов
	|		ПО Аук_УчастникиАукционовКонтактныеЛица.КонтактноеЛицо = АукКонтактныеЛицаУчастниковАукционов.Ссылка
	|ГДЕ
	|	Аук_УчастникиАукционовКонтактныеЛица.Ссылка В(&Участники)
	|	И Аук_УчастникиАукционовКонтактныеЛица.ВидАукциона = &ВидАукциона
	|ИТОГИ ПО
	|	Участник";
	
	Запрос.УстановитьПараметр("Участники",		пУчастники); 
	Запрос.УстановитьПараметр("ВидАукциона",	пВидАукциона);
	
	ВыборкаУчастник = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	сооРезультат = Новый Соответствие;
	
	Пока ВыборкаУчастник.Следующий() Цикл
		
		ВыборкаДетальная = ВыборкаУчастник.Выбрать();
		
		масКонтактныеЛица = Новый Массив;
		
		Пока ВыборкаДетальная.Следующий() Цикл
			
			масКонтактныеЛица.Добавить(ВыборкаДетальная.КонтактноеЛицо);
			
		КонецЦикла;
		
		сооРезультат.Вставить(ВыборкаУчастник.Участник, масКонтактныеЛица);
		
	КонецЦикла;	
	
	Возврат сооРезультат;
	
КонецФункции

Функция УчастникиИИхКонтактныеЛица() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукУчастникиАукционов.Ссылка КАК Участник,
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка КАК КонтактноеЛицо
	|ИЗ
	|	Справочник.АукУчастникиАукционов КАК АукУчастникиАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукКонтактныеЛицаУчастниковАукционов КАК АукКонтактныеЛицаУчастниковАукционов
	|		ПО АукУчастникиАукционов.Ссылка = АукКонтактныеЛицаУчастниковАукционов.Владелец
	|ГДЕ
	|	НЕ АукУчастникиАукционов.ПометкаУдаления
	|ИТОГИ ПО
	|	Участник";
	
	Возврат Запрос.Выполнить();
КонецФункции	

Функция ОбновитьВидыАукционовВЭлементахУчастников(пПараметры) Экспорт

	НачатьТранзакцию();
	Попытка
		
		Для Каждого ЭлСоо Из пПараметры.УчастникиИКонтактныеЛица Цикл
			сткДанные = Новый Структура;
			сткДанные.Вставить("ВидАукциона",		пПараметры.ВидАукциона);
			сткДанные.Вставить("Участник",			ЭлСоо.Ключ);
			сткДанные.Вставить("КонтактныеЛица",	ЭлСоо.Значение);
			
			ОбновитьВидАукционаУУчастника(сткДанные);	
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
		
		Возврат ЭдоОбщий._Успех();
	Исключение
		ОтменитьТранзакцию();
		
		стрОшибка = ОписаниеОшибки();
		
		Возврат ЭдоОбщий._Ошибка(стрОшибка);
	КонецПопытки;	
		
КонецФункции	

Функция ДанныеУчастникаПоСсылке(пУчастник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукУчастникиАукционов.Наименование КАК Наименование,
	|	АукУчастникиАукционов.Банк КАК Банк,
	|	АукУчастникиАукционов.Описание КАК Описание
	|ИЗ
	|	Справочник.АукУчастникиАукционов КАК АукУчастникиАукционов
	|ГДЕ
	|	АукУчастникиАукционов.Ссылка = &Участник";
	
	Запрос.УстановитьПараметр("Участник", пУчастник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьВидАукционаУУчастника(пСткДанные)

	СпрОб = пСткДанные.Участник.ПолучитьОбъект();
	
	// 1. Добавить вид аукциона в ТЧ ВидыАукционов
	НовСтрока1 = СпрОб.ВидыАукционов.Добавить();
	
	НовСтрока1.ВидАукциона = пСткДанные.ВидАукциона;
	
	// 2. Добавить контактные лица в ТЧ КонтактныеЛица
	Для Каждого ЭлМас Из пСткДанные.КонтактныеЛица Цикл
		НовСтрока2 = СпрОб.КонтактныеЛица.Добавить();
	
		НовСтрока2.ВидАукциона		= пСткДанные.ВидАукциона;
		НовСтрока2.КонтактноеЛицо	= ЭлМас;
	КонецЦикла;
	
	сткРез = ОбщегоНазначения.ЗаписатьОбъектВБазу(СпрОб);
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
